/* BridgeConfViewController; first placeholder is bullet point (\u{2022}), second placeholder is bridge type "obfs4" */
"%@ %@ makes traffic appear \"random\"." = "%@ %@ makes traffic appear \"random\".";

/* BridgeConfViewController; first placeholder is bullet point (\u{2022}), second placeholder is bridge type "meek-azure" */
"%@ %@ makes your traffic pose as traffic to a Microsoft website." = "%@ %@ makes your traffic pose as traffic to a Microsoft website.";

/* RuleEditorController */
"%@ (Disabled: %@)" = "%1$@ (Disabled: %2$@)";

/* Storage2ViewController */
"%@ cookies" = "%@ cookies";

/* SecurityPresetsRow */
"(not recommended)" = "(not recommended)";

/* Storage2ViewController */
"(other cache data)" = "(other cache data)";

/* SecurityPresetsRow */
"(recommended)" = "(recommended)";

/* SettingsViewController */
"About" = "About";

/* AdvancedTorConfViewController */
"Add additional command line options for Tor startup." = "Add additional command line options for Tor startup.";

/* BookmarkViewController */
"Add Bookmark" = "Add Bookmark";

/* CustomSitesViewController, AddSiteViewController */
"Add Site" = "Add Site";

/* BookmarkViewController */
"Address" = "Address";

/* SettingsViewController */
"Advanced Tor Configuration" = "Advanced Tor Configuration";

/* BridgeConfViewController */
"Advanced Tor Configuration Removed" = "Advanced Tor Configuration Removed";

/* RuleEditorController */
"All rules" = "All rules";

/* SettingsViewController */
"Allow 3rd-Party Keyboards" = "Allow 3rd-Party Keyboards";

/* SecurityViewController */
"Allow hosts to access WebRTC functions." = "Allow hosts to access WebRTC functions.";

/* SecurityViewController */
"Allow hosts to permanently store cookies and local storage databases." = "Allow hosts to permanently store cookies and local storage databases.";

/* SecurityViewController */
"Allow HTTPS hosts to load page resources from non-HTTPS hosts. (Useful for RSS readers and other aggregators.)" = "Allow HTTPS hosts to load page resources from non-HTTPS hosts. (Useful for RSS readers and other aggregators.)";

/* SecurityViewController */
"Allow Persistent Cookies" = "Allow Persistent Cookies";

/* Tab+UIWebViewDelegate */
"Allow this page to close its tab?" = "Allow this page to close its tab?";

/* Tab+Gestures */
"An error occurred downloading image %@" = "An error occurred downloading image %@";

/* DonationViewController */
"Are you sure you want to send a %@ tip?" = "Are you sure you want to send a %@ tip?";

/* AppDelegate */
"Authentication Required" = "Authentication Required";

/* SettingsViewController */
"Auto-Complete Search Results" = "Auto-Complete Search Results";

/* Storage1ViewController */
"Auto-Sweep Interval" = "Auto-Sweep Interval";

/* CertificateViewController */
"Begins On" = "Begins On";

/* URLBlockerRuleController */
"Blocked 3rd-Party Hosts" = "Blocked 3rd-Party Hosts";

/* BookmarksViewController */
"Bookmarks" = "Bookmarks";

/* BridgeConfViewController */
"Bridge Configuration" = "Bridge Configuration";

/* BridgeConfViewController; placeholder contains bridge type names: "meek-azure" or "obfs4" */
"Built-in %@" = "Built-in %@";

/* SecurityViewController */
"By editing this setting, you have created a custom security setting." = "By editing this setting, you have created a custom security setting.";

/* ScanQrViewController */
"Camera access was not granted or QR Code scanning is not supported by your device." = "Camera access was not granted or QR Code scanning is not supported by your device.";

/* AlertHelper */
"Cancel" = "Cancel";

/* CertificateViewController */
"Certificate Information" = "Certificate Information";

/* SettingsViewController */
"Changing this option requires restarting the app." = "Changing this option requires restarting the app.";

/* SettingsViewController */
"Choose how long app remembers open tabs." = "Choose how long app remembers open tabs.";

/* CertificateViewController */
"Cipher" = "Cipher";

/* AppDelegate */
"Close Tab" = "Close Tab";

/* BridgesViewController */
"Configure Bridges" = "Configure Bridges";

/* Tab+UIWebViewDelegate */
"Confirm" = "Confirm";

/* DonationViewController */
"Confirm %@" = "Confirm %@";

/* DonationViewController */
"Confirm Purchase" = "Confirm Purchase";

/* BridgeConfViewController, CustomBridgesViewController */
"Connect" = "Connect";

/* BridgesViewController */
"Connect to Tor" = "Connect to Tor";

/* BridgesViewController */
"Connect to Tor for private browsing." = "Connect to Tor for private browsing.";

/* ConnectingViewController */
"Connected!" = "Connected!";

/* ConnectingViewController */
"Connecting to Tor" = "Connecting to Tor";

/* CertificateViewController */
"Connection Information" = "Connection Information";

/* SecurityViewController */
"Content Policy" = "Content Policy";

/* SettingsViewController, Storage1ViewController, Storage2ViewController */
"Cookies and Local Storage" = "Cookies and Local Storage";

/* Storage1ViewController */
"Cookies and local storage data from non-whitelisted hosts will be cleared even from open tabs after not being accessed for this many minutes." = "Cookies and local storage data from non-whitelisted hosts will be cleared even from open tabs after not being accessed for this many minutes.";

/* Tab+Gestures */
"Copy URL" = "Copy URL";

/* CustomBridgesViewController */
"Copy URL to Clipboard" = "Copy URL to Clipboard";

/* AppDelegate */
"Create New Tab" = "Create New Tab";

/* SecurityPresetsRow; a security level */
"Custom" = "Custom";

/* BridgeConfViewController */
"Custom Bridges" = "Custom Bridges";

/* SettingsViewController, CustomSitesViewController */
"Custom Site Security" = "Custom Site Security";

/* SecurityViewController */
"Custom user-agent string, or blank to use the default." = "Custom user-agent string, or blank to use the default.";

/* SecurityPopUpViewController */
"Customize" = "Customize";

/* SecurityViewController */
"Default Security" = "Default Security";

/* InitSecurityLevelViewController */
"Define Default Security Level" = "Define Default Security Level";

/* CustomSitesViewController */
"Define custom settings for specific sites." = "Define custom settings for specific sites.";

/* RuleEditorController */
"Disable" = "Disable";

/* RuleEditorController */
"Disabled: %@" = "Disabled: %@";

/* DonationViewController */
"Donate" = "Donate";

/* Bookmark, placeholder is app name "Onion Browser" */
"Donate to %@" = "Donate to %@";

/* BrowsingViewController */
"Done" = "Done";

/* BookmarkViewController */
"Edit Bookmark" = "Edit Bookmark";

/* RuleEditorController */
"Enable" = "Enable";

/* AlertHelper */
"Error" = "Error";

/* SecurityPresetsRow */
"Everything should work." = "Everything should work.";

/* CertificateViewController */
"Expires After" = "Expires After";

/* CertificateViewController */
"Extended Validation: Organization" = "Extended Validation: Organization";

/* AppDelegate */
"Focus URL Field" = "Focus URL Field";

/* SettingsViewController */
"Forget at Shutdown" = "Forget at Shutdown";

/* SettingsViewController */
"Forget in Background" = "Forget in Background";

/* MainViewController */
"Free to be you." = "Free to be you.";

/* SettingsViewController */
"Fund Development" = "Fund Development";

/* AppDelegate */
"Go Back" = "Go Back";

/* AppDelegate */
"Go Forward" = "Go Forward";

/* CircuSitsViewController */
"Guard" = "Guard";

/* SecurityViewController */
"Handle tapping on links in a non-standard way to avoid possibly opening external applications." = "Handle tapping on links in a non-standard way to avoid possibly opening external applications.";

/* HistoryViewController */
"History" = "History";

/* AddSiteViewController */
"Host" = "Host";

/* SettingsViewController */
"HTTPS Everywhere" = "HTTPS Everywhere";

/* HTTPSEverywhereRuleController */
"HTTPS Everywhere Rules" = "HTTPS Everywhere Rules";

/* BridgeConfViewController */
"If one type of bridge does not work, try using a different one." = "If one type of bridge does not work, try using a different one.";

/* BridgesViewController, BridgeConfViewController */
"If you are in a country or using a connection that censors Tor, you might need to use bridges." = "If you are in a country or using a connection that censors Tor, you might need to use bridges.";

/* Tab+UIWebViewDelegate */
"Ignore for this host" = "Ignore for this host";

/* SecurityViewController */
"Ignore TLS Errors" = "Ignore TLS Errors";

/* CustomBridgesViewController; placeholder contains "https://bridges.torproject.org/", please visit that page and copy texts for your language! */
"In a separate browser, visit %@ and tap \"Get Bridges\" > \"Just Give Me Bridges!\"" = "In a separate browser, visit %@ and tap \"Get Bridges\" > \"Just Give Me Bridges!\"";

/* SecurityPresetsRow; a security level */
"Insecure" = "Insecure";

/* CertificateViewController */
"Issued By" = "Issued By";

/* CertificateViewController */
"Issued To" = "Issued To";

/* SecurityPopUpViewController */
"Learn More" = "Learn More";

/* Bookmark, placeholder is app name "Onion Browser" */
"Learn more about %@" = "Learn more about %@";

/*MainViewController; placeholder is a angle bracket \u{276c} or \u{276d} depending on text direction. */
"Let's go %@" = "Let's go %@";

/* DonationViewController */
"Loading in-app purchase data…" = "Loading in-app purchase data…";

/* Storage2ViewController */
"Local Storage" = "Local Storage";

/* AppDelegate */
"Log In" = "Log In";

/* ErrorViewController */
"Looks like we got stuck! Quit. Then restart the app." = "Looks like we got stuck! Quit. Then restart the app.";

/* SecurityPresetsRow */
"Many things won't work." = "Many things won't work.";

/* SettingsViewController */
"Minimum version of TLS required for hosts to negotiate HTTPS connections." = "Minimum version of TLS required for hosts to negotiate HTTPS connections.";

/* SettingsViewController */
"Miscellaneous" = "Miscellaneous";

/* SecurityViewController */
"Mixed-mode Resources" = "Mixed-mode Resources";

/* SecurityPresetsRow; a security level */
"Moderate" = "Moderate";

/* SettingsViewController */
"Mute Audio with Mute Switch" = "Mute Audio with Mute Switch";

/* CircuSitsViewController */
"New Circuit for this Site" = "New Circuit for this Site";

/* ConnectingViewController */
"Next" = "Next";

/* BridgeConfViewController */
"No Bridges" = "No Bridges";

/* SecurityViewController */
"No XHR/WebSocket/Video connections" = "No XHR/WebSocket/Video connections";

/* JAHPAuthenticatingHTTPProtocol, AlertHelper */
"OK" = "OK";

/* Tab+Gestures */
"Open" = "Open";

/* SecurityViewController */
"Open (normal browsing mode)" = "Open (normal browsing mode)";

/* Tab+Gestures */
"Open in a New Tab" = "Open in a New Tab";

/* Tab+Gestures */
"Open in Background Tab" = "Open in Background Tab";

/* Tab+Gestures */
"Open in Safari" = "Open in Safari";

/* SecurityViewController */
"Other" = "Other";

/* AppDelegate */
"Password" = "Password";

/* CustomBridgesViewController */
"Paste Bridges" = "Paste Bridges";

/* DonationViewController */
"Payment Sent" = "Payment Sent";

/* CertificateViewController */
"Period of Validity" = "Period of Validity";

/* SecurityViewController */
"Privacy" = "Privacy";

/* SettingsViewController */
"Privacy & Security" = "Privacy & Security";

/* CertificateViewController */
"Protocol" = "Protocol";

/* Tab */
"Pull to Refresh Page" = "Pull to Refresh Page";

/* DonationViewController */
"Purchase Failure" = "Purchase Failure";

/* BridgeConfViewController */
"Quit. Then restart the app." = "Quit. Then restart the app.";

/* CustomBridgesViewController; placeholder is "" "https://bridges.torproject.org/" */
"QR Code could not be decoded! Are you sure you scanned a QR code from %@?" = "QR Code could not be decoded! Are you sure you scanned a QR code from %@?";

/* SettingsViewController */
"Rate on App Store" = "Rate on App Store";

/* AppDelegate */
"Reload Tab" = "Reload Tab";

/* TabSecurity */
"Remember Tabs" = "Remember Tabs";

/* BridgeConfViewController */
"Remove Advanced Tor Conf" = "Remove Advanced Tor Conf";

/* Storage2ViewController */
"Remove All Local Storage" = "Remove All Local Storage";

/* SettingsViewController */
"Report a Bug" = "Report a Bug";

/* SecurityViewController */
"Restrictions on resources loaded from web pages." = "Restrictions on resources loaded from web pages.";

/* RuleEditorController */
"Rules in use on current page" = "Rules in use on current page";

/* Tab+Gestures */
"Save Image" = "Save Image";

/* CustomBridgesViewController, ScanQrViewController */
"Scan QR Code" = "Scan QR Code";

/* SettingsViewController */
"Search" = "Search";

/* SettingsViewController */
"Search Engine" = "Search Engine";

/* SecurityPresetsRow; a security level */
"Secure" = "Secure";

/* SecurityPopUpViewController */
"Security Level for This Site" = "Security Level for This Site";

/* SettingsViewController */
"Send Do-Not-Track Header" = "Send Do-Not-Track Header";

/* CertificateViewController */
"Serial Number" = "Serial Number";

/* SettingsViewController */
"Settings" = "Settings";

/* SecurityPresetsRow */
"Settings have been customized." = "Settings have been customized.";

/* Storage2ViewController */
"Show All Sites" = "Show All Sites";

/* AppDelegate */
"Show Bookmarks" = "Show Bookmarks";

/* CertificateViewController */
"Signature Algorithm" = "Signature Algorithm";

/* DonationViewController */
"Sorry, in-app purchase is disabled on your device!" = "Sorry, in-app purchase is disabled on your device!";

/* InitSecurityLevelViewController */
"Start Browsing" = "Start Browsing";

/* SettingsViewController */
"Stop Auto-Complete at First Dot" = "Stop Auto-Complete at First Dot";

/* SecurityViewController */
"Strict (no JavaScript, video, etc.)" = "Strict (no JavaScript, video, etc.)";

/* SecurityPresetsRow */
"Some things won't work." = "Some things won't work.";

/* Bookmark */
"Subscribe to Tor Newsletter" = "Subscribe to Tor Newsletter";

/* SettingsViewController */
"Support" = "Support";

/* DonationViewController */
"Support Onion Browser Development" = "Support Onion Browser Development";

/* AppDelegate */
"Switch to Tab %d" = "Switch to Tab %d";

/* SettingsViewController */
"Tab Security" = "Tab Security";

/* CircuSitsViewController */
"This browser" = "This browser";

/* DonationViewController */
"Tip: %@" = "Tip: %@";

/* BookmarkViewController */
"Title" = "Title";

/* SecurityViewController, placeholder is app name "Onion Browser" */
"This is your default security setting for every website you visit in %@." = "This is your default security setting for every website you visit in %@.";

/* SettingsViewController */
"TLS 1.3, 1.2, 1.1 or 1.0" = "TLS 1.3, 1.2, 1.1 or 1.0";

/* SettingsViewController */
"TLS 1.3 or 1.2" = "TLS 1.3 or 1.2";

/* SettingsViewController */
"TLS 1.3 Only" = "TLS 1.3 Only";

/* Tab+UIWebViewDelegate */
"TLS certificate chain verification error (self-signed certificate?)" = "TLS certificate chain verification error (self-signed certificate?)";

/* Tab+UIWebViewDelegate */
"TLS handshake failed" = "TLS handshake failed";

/* Tab+UIWebViewDelegate */
"TLS protocol error" = "TLS protocol error";

/* SettingsViewController */
"TLS Version" = "TLS Version";

/* AdvancedTorConfViewController */
"To recover from a non working configuration, remove everything under \"Bridge Configuration\" on startup and restart the app." = "To recover from a non working configuration, remove everything under \"Bridge Configuration\" on startup and restart the app.";

/* CircuitsViewController */
"Tor Circuit" = "Tor Circuit";

/* SecurityViewController */
"Universal Link Protection" = "Universal Link Protection";

/* CustomBridgesViewController */
"Upload QR Code" = "Upload QR Code";

/* SettingsViewController */
"URL Blocker" = "URL Blocker";

/* CustomBridgesViewController */
"Use Custom Bridges" = "Use Custom Bridges";

/* CustomBridgesViewController */
"Use QR Code" = "Use QR Code";

/* SecurityViewController */
"User Agent" = "User Agent";

/* RuleEditorController */
"User disabled" = "User disabled";

/* AppDelegate */
"Username" = "Username";

/* CertificateViewController */
"Version" = "Version";

/* SettingsViewController */
"Version %@" = "Version %@";

/* SecurityViewController */
"WebRTC" = "WebRTC";

/* SettingsViewController */
"When disabled, all text entered in search bar will be sent to the search engine unless it starts with \"http\"." = "When disabled, all text entered in search bar will be sent to the search engine unless it starts with \"http\".";

/* AdvancedTorConfViewController; placeholder is URL https://www.torproject.org/docs/tor-manual.html */
"Refer to %@ for possible options." = "Refer to %@ for possible options.";

/* DonationViewController */
"You most recently donated %@ on %@." = "You most recently donated %@ on %@.";

/* InitSecurityLevelViewController */
"Your security level will apply to every website you visit and may affect their performance. Security levels can be modified per site by tapping the shield icon in your browser." = "Your security level will apply to every website you visit and may affect their performance. Security levels can be modified per site by tapping the shield icon in your browser.";

/* ConnectingViewController */
"__CLAIM_1__" = "Our diverse community is what makes Tor great!";

/* ConnectingViewController */
"__CLAIM_2__" = "Everyday people use Tor to avoid being followed by marketing ads.";

/* ConnectingViewController */
"__CLAIM_3__" = "People use Tor to safely stay connected with their friends and family.";

/* ConnectingViewController */
"__CLAIM_4__" = "Activists use Tor to freely express their opinions and beliefs.";

/* ConnectingViewController */
"__CLAIM_5__" = "Bloggers use Tor to rally people toward social reform.";

/* ConnectingViewController */
"__CLAIM_6__" = "Journalists use Tor to securely investigate stories they are reporting on.";

/* ConnectingViewController */
"__CLAIM_7__" = "Business people use Tor to keep their company strategies private.";

/* ConnectingViewController */
"__CLAIM_8__" = "Workers use Tor to fight for justice without fear of losing their job.";

/* DonationViewController */
"__DONATE_EXPLANATION_PARAGRAPH1__" = "Onion Browser is a free app, but it takes time and resources to develop and maintain.";

/* DonationViewController */
"__DONATE_EXPLANATION_PARAGRAPH2__" = "You can support the app by sending a small tip through an in-app purchase, below. This is a one-time, non-recurring transaction, but you can come back any time to send another. No information about your in-app purchase is collected or stored by the Onion Browser developers.";

/* DonationViewController */
"__DONATE_EXPLANATION_PARAGRAPH3__" = "You can learn about other ways to help (including Patreon, PayPal, Bitcoin, or Zcash) in the 'About' section of the 'Settings' page.";

/* DonationViewController */
"__DONATE_THANKS__" = "Thank you! Every little bit helps! Your payment of %@ helps ensure continuing development on Onion Browser and tools that make Tor easier to integrate into other iOS apps.";
